openmv/openmv/ports/stm32/omv_csi.c
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            if (HAL_DCMIPP_Init(&csi->dcmipp) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Select and configure the DCMIPP source.
            DCMIPP_CSI_ConfTypeDef scfg = {
                .NumberOfLanes = DCMIPP_CSI_TWO_DATA_LANES,
                .DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES,
                .PHYBitrate = (csi->mipi_brate == 850) ? DCMIPP_CSI_PHY_BT_850 : DCMIPP_CSI_PHY_BT_1200,
            };

            if (HAL_DCMIPP_CSI_SetConfig(&csi->dcmipp, &scfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Configure CSI virtual channel and pipe.
            DCMIPP_CSI_PIPE_ConfTypeDef csi_pcfg = {
                .DataTypeMode = DCMIPP_DTMODE_DTIDA,
                .DataTypeIDA = DCMIPP_DT_RAW10,
                .DataTypeIDB = DCMIPP_DT_RAW10,
            };

            if (HAL_DCMIPP_CSI_SetVCConfig(&csi->dcmipp, DCMIPP_VIRTUAL_CHANNEL0,
                        DCMIPP_CSI_DT_BPP10) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            if (HAL_DCMIPP_CSI_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE, &csi_pcfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Store CSI handle used for DCMIPP
            stm_csi_all[CSI_HANDLE_DCMIPP] = csi;

            // Configure and enable DCMI IRQ Channel
            NVIC_SetPriority(DCMIPP_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(DCMIPP_IRQn);

            // Configure and enable CSI IRQ Channel
            NVIC_SetPriority(CSI_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(CSI_IRQn);
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_DEINIT) {
        if (!csi->mipi_if) {
            HAL_NVIC_DisableIRQ(DCMI_IRQn);
            HAL_DCMI_DeInit(&csi->dcmi);
        } else {
            #if USE_DCMIPP
            HAL_NVIC_DisableIRQ(DCMIPP_IRQn);
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_PIXFORMAT) {
        if (!csi->mipi_if) {
            DCMI->CR &= ~(DCMI_CR_JPEG_Msk << DCMI_CR_JPEG_Pos);
            DCMI->CR |= (csi->pixformat == PIXFORMAT_JPEG) ? DCMI_JPEG_ENABLE : DCMI_JPEG_DISABLE;
        } else {
            #if USE_DCMIPP
            csi->dcmipp.State = HAL_DCMIPP_STATE_READY;
            // Reset pipes states to allow reconfiguring them.
            for (size_t i=0; i<DCMIPP_NUM_OF_PIPES; i++) {
                csi->dcmipp.PipeState[i] = HAL_DCMIPP_PIPE_STATE_RESET;
            }
            // Configure the pixel processing pipeline.
            if (stm_isp_config_pipeline(&csi->dcmipp, DCMIPP_PIPE, csi->pixformat, csi->raw_output)) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }
            #endif
        }
    }

    return 0;
}

// Stop the DCMI from generating more DMA requests, and disable the DMA.
static int stm_csi_abort(omv_csi_t *csi, bool fifo_flush, bool in_irq) {
    csi->dma_size = 0;

    if (!stm_csi_is_active(csi)) {
        return 0;
    }

    if (!csi->mipi_if) {
        DCMI->CR &= ~DCMI_CR_ENABLE;
        while (DCMI->CR & DCMI_CR_ENABLE);

        #if defined(STM32N6)
        HAL_DMA_Abort(&csi->dma);
        #else
        if (in_irq) {
            HAL_DMA_Abort_IT(&csi->dma);
        } else {
            HAL_DMA_Abort(&csi->dma);
        }
        #endif
        HAL_NVIC_DisableIRQ(csi->dma_irqn);

        #if USE_MDMA
        if (!in_irq) {
            HAL_MDMA_Abort(&csi->mdma0);
            HAL_MDMA_Abort(&csi->mdma1);
        }
        HAL_MDMA_DeInit(&csi->mdma0);
        HAL_MDMA_DeInit(&csi->mdma1);
        #endif

        __HAL_DCMI_DISABLE_IT(&csi->dcmi, DCMI_IT_FRAME);
        __HAL_DCMI_CLEAR_FLAG(&csi->dcmi, DCMI_FLAG_FRAMERI);
    } else {
        #if USE_DCMIPP
        HAL_DCMIPP_CSI_PIPE_Stop(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_VIRTUAL_CHANNEL0);
        #endif // USE_DCMIPP
    }
    return 0;
}

static int stm_csi_shutdown(omv_csi_t *csi, int enable) {
    int ret = 0;
    if (enable) {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_DEINIT);
    } else {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_INIT);
    }
    return ret;
}

static uint32_t stm_clk_get_frequency(omv_clk_t *clk) {
    if (!clk->tim.Instance) {
        return 0;
    }
    return (OMV_CSI_TIM_PCLK_FREQ() * 2) / (clk->tim.Init.Period + 1);
}

static int stm_clk_set_frequency(omv_clk_t *clk, uint32_t frequency) {
    #if (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_TIM)
    if (frequency == 0) {
        if (clk->tim.Init.Period) {
            HAL_TIM_PWM_Stop(&clk->tim, OMV_CSI_TIM_CHANNEL);
            HAL_TIM_PWM_DeInit(&clk->tim);
            memset(&clk->tim, 0, sizeof(clk->tim));
        }
        return 0;
    }

    clk->tim.Instance = OMV_CSI_TIM;

    // TCLK (PCLK * 2)
    int tclk = OMV_CSI_TIM_PCLK_FREQ() * 2;

    // Find highest possible frequency under requested.
    int period = fast_ceilf(tclk / ((float) frequency)) - 1;
    int pulse = (period + 1) / 2;

    if (clk->tim.Init.Period && (clk->tim.Init.Period != period)) {
        // __HAL_TIM_SET_AUTORELOAD sets clk->tim.Init.Period...
        __HAL_TIM_SET_AUTORELOAD(&clk->tim, period);
        __HAL_TIM_SET_COMPARE(&clk->tim, OMV_CSI_TIM_CHANNEL, pulse);
        return 0;
    }

    /* Timer base configuration */
    clk->tim.Init.Period = period;
    clk->tim.Init.Prescaler = 0;
    clk->tim.Init.CounterMode = TIM_COUNTERMODE_UP;
    clk->tim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    clk->tim.Init.RepetitionCounter = 0;
    clk->tim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    /* Timer channel configuration */
    TIM_OC_InitTypeDef TIMOCHandle;
    TIMOCHandle.Pulse = pulse;
    TIMOCHandle.OCMode = TIM_OCMODE_PWM1;
    TIMOCHandle.OCPolarity = TIM_OCPOLARITY_HIGH;
    TIMOCHandle.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    TIMOCHandle.OCFastMode = TIM_OCFAST_DISABLE;
    TIMOCHandle.OCIdleState = TIM_OCIDLESTATE_RESET;
    TIMOCHandle.OCNIdleState = TIM_OCNIDLESTATE_RESET;

