openmv/openmv/ports/stm32/omv_csi.c
    if (!csi->transpose) {
        dst += fb->u * bytes_per_pixel * buffer->offset++;
    } else {
        dst += bytes_per_pixel * buffer->offset++;
    }

    #if USE_MDMA
    // Two MDMA channels are used to maximize the time available to finish the transfer.
    omv_csi_copy_line(csi, (buffer->offset % 2) ? &csi->mdma1 : &csi->mdma0, src, dst);
    #else
    omv_csi_copy_line(csi, NULL, src, dst);
    #endif
}
#endif  // #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)

static int stm_csi_snapshot(omv_csi_t *csi, image_t *image, uint32_t flags) {
    framebuffer_t *fb = csi->fb;

    if (csi->pixformat == PIXFORMAT_INVALID) {
        return OMV_CSI_ERROR_INVALID_PIXFORMAT;
    }

    if (csi->framesize == OMV_CSI_FRAMESIZE_INVALID) {
        return OMV_CSI_ERROR_INVALID_FRAMESIZE;
    }

    // Compress the framebuffer for the IDE preview, if not the first frame, the
    // framebuffer is enabled, and the image sensor doesn't support JPEG encoding.
    if (flags & OMV_CSI_CAPTURE_FLAGS_UPDATE) {
        image_t tmp;
        framebuffer_init_image(fb, &tmp);
        framebuffer_update_jpeg_buffer(&tmp);
    }

    // Ensure that the raw frame fits into the FB. It will be switched from RGB565
    // to BAYER first to save space before being cropped until it fits.
    omv_csi_auto_crop_framebuffer(csi);

    // Restore frame buffer width and height if they were changed before. BPP is
    // restored later. Note that JPEG compression is done first on the framebuffer
    // with the user settings.
    uint32_t w = fb->u;
    uint32_t h = fb->v;

    // If DCMI_DMAConvCpltUser() happens before framebuffer_free_current_buffer();
    // below then the transfer is stopped and it will be re-enabled again right
    // afterwards in the single vbuffer case.
    framebuffer_free_current_buffer(fb);

    // Configure and start the capture.
    if (!stm_csi_is_active(csi)) {
        framebuffer_setup_buffers(fb);

        // Get the destination buffer address.
        vbuffer_t *buffer = framebuffer_get_tail(fb, FB_PEEK);
        if (buffer == NULL) {
            return OMV_CSI_ERROR_FRAMEBUFFER_ERROR;
        }

        if (csi->mipi_if) {
            #if USE_DCMIPP
            uint32_t bytes_per_pixel = omv_csi_get_dst_bpp(csi);
            uint32_t line_width = fb->u * bytes_per_pixel;

            if (!line_width ||
                line_width % OMV_CSI_LINE_ALIGNMENT) {
                return OMV_CSI_ERROR_INVALID_FRAMESIZE;
            }

            // Configure crop
            DCMIPP_CropConfTypeDef ccfg = {
                .HStart = fb->x,
                .VStart = fb->y,
                .HSize = fb->u,
                .VSize = fb->v,
            };
            if (HAL_DCMIPP_PIPE_SetCropConfig(&csi->dcmipp, DCMIPP_PIPE, &ccfg) != HAL_OK ||
                HAL_DCMIPP_PIPE_EnableCrop(&csi->dcmipp, DCMIPP_PIPE) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Set output pitch
            if (HAL_DCMIPP_PIPE_SetPitch(&csi->dcmipp, DCMIPP_PIPE, line_width) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Start the DCMIPP
            if (HAL_DCMIPP_CSI_PIPE_Start(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_VIRTUAL_CHANNEL0,
                                          (uint32_t) buffer->data, DCMIPP_MODE_CONTINUOUS) != HAL_OK) {
                return OMV_CSI_ERROR_CAPTURE_FAILED;
            }
            #endif  // USE_DCMIPP
        } else {
            // Setup the size and address of the transfer
            uint32_t bytes_per_pixel = omv_csi_get_src_bpp(csi);
            uint32_t x_crop = get_dcmi_hw_crop(csi, bytes_per_pixel);
            uint32_t line_width = resolution[csi->framesize][0] * bytes_per_pixel;

            // Shrink the captured pixel count by one word to allow cropping to fix alignment.
            if (x_crop) {
                line_width -= 4;
            }

            csi->dma_size = line_width * h / 4;

            // Error out if the transfer size is not compatible with DMA transfer restrictions.
            if ((!line_width) || (line_width % 4) ||
                #if defined(OMV_LINE_BUF_SIZE)
                (line_width > (OMV_LINE_BUF_SIZE / 2)) ||
                #endif
                (!csi->dma_size) || (csi->dma_size % OMV_CSI_LINE_ALIGNMENT)) {
                return OMV_CSI_ERROR_INVALID_FRAMESIZE;
            }

            HAL_DCMI_DisableCrop(&csi->dcmi);
            if (csi->pixformat != PIXFORMAT_JPEG) {
                // Vertically crop the image. Horizontal cropping is done in software.
                HAL_DCMI_ConfigCrop(&csi->dcmi, x_crop, fb->y, line_width - 1, h - 1);
                HAL_DCMI_EnableCrop(&csi->dcmi);
            }

            #if USE_MDMA
            // Configure MDMA for non-JPEG modes. MDMA will be used to either
            // completely offload the transfer, in case of non-transposed mode
            // or copy transposed lines.
            if (csi->pixformat != PIXFORMAT_JPEG) {
                stm_mdma_init(csi, bytes_per_pixel, x_crop);
            }
            #endif

            // Reset the DMA state and re-enable it.
            #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
            OMV_CSI_DMA_CHANNEL->CR &= ~(DMA_SxCR_CIRC | DMA_SxCR_CT | DMA_SxCR_DBM);
            #endif
            HAL_NVIC_EnableIRQ(csi->dma_irqn);

            // HAL_DCMI_Start_DMA and HAL_DCMI_Start_DMA_MB both perform circular transfers,
            // differing only in size, with an interrupt after every half of the transfer.
            if ((csi->pixformat == PIXFORMAT_JPEG) && (csi->jpg_format == 3)) {
                // Start a one-shot transfer to the framebuffer, used only for JPEG mode 3.
                uint32_t size = framebuffer_get_buffer_size(fb);
                csi->dma_size = IM_MIN(size, (OMV_CSI_DMA_MAX_SIZE * 2U)) / 4;
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
            #if USE_MDMA
            } else if ((csi->pixformat != PIXFORMAT_JPEG) && (!csi->transpose)) {
                // Special transfer mode that uses DMA in circular mode and MDMA
                // to move the lines to the final destination.
                ((DMA_Stream_TypeDef *) csi->dma.Instance)->CR |= DMA_SxCR_CIRC;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, line_width / 4);
            #endif  // USE_MDMA
            } else {
                #if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
                // Start a multibuffer (line by line) transfer.
                HAL_DCMI_Start_DMA_MB(&csi->dcmi, DCMI_MODE_CONTINUOUS, (uint32_t) &_line_buf, csi->dma_size, h);
                #else
                csi->one_shot = true;
                HAL_DCMI_Start_DMA(&csi->dcmi, DCMI_MODE_SNAPSHOT, (uint32_t) buffer->data, csi->dma_size);
                #endif
            }
        }
    }

